---
type: TextNoteOptions
namespace: Autodesk.Revit.DB
version: 2024
members: 9
tags: [revit-api, class]
---

# TextNoteOptions

`Autodesk.Revit.DB.TextNoteOptions` · Revit 2024 · 9 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Constructor | TextNoteOptions | — | `` |
| Constructor | TextNoteOptions | 2016 | `public TextNoteOptions ()` |
| Method | Dispose | — | `public void Dispose ()` |
| Property | HorizontalAlignment | 2016 | `public HorizontalTextAlignment HorizontalAlignment { get ; set ; }` |
| Property | IsValidObject | 2014 | `public bool IsValidObject { get ; }` |
| Property | KeepRotatedTextReadable | 2016 | `public bool KeepRotatedTextReadable { get ; set ; }` |
| Property | Rotation | 2016 | `public double Rotation { get ; set ; }` |
| Property | TypeId | 2016 | `public ElementId TypeId { get ; set ; }` |
| Property | VerticalAlignment | 2016 | `public VerticalTextAlignment VerticalAlignment { get ; set ; }` |